1s/ERP/Conf/Documents/Лико_ЗаказОснастки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ЗаказОснастки</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПлощадкаУдалить</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ВидыОперацийЗаказОснастки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срочный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательУдалить</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутреннийЗаказ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БизнесРегионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оснастка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидШтампа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРаботСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Менеджер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_СтатусыЗаказовНаОснастку</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тираж</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРЦ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШиринаЭтикетки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлинаЭтикетки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нарезка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШагПечати</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Z</Name>
							<Comment>Количество зубьев</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ZКоличествоЗубьев</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтикетокНаЛисте</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ручьи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнтервалМеждуРучьями</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнтервалМеждуЭтикетками</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеНамотки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Намотка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Диаметр</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Радиус</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипВырубки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_ТипыВырубки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИнструмента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_ТипИнструмента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПечати</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_ВидыПечати</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЦветов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШиринаРукава</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подложка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Подложка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочийЦентр</Name>
							<Comment>Рабочий центр для Omega</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>_3DМодель</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Книжка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вклейка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Трудозатраты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разработчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказНаПроизводство</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВнутреннийЗаказ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БизнесРегионы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Этикетки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Этикетка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_НаправленияПротяжки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_НаправленияПротяжки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Продольное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поперечное</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_СтатусыЗаказаНаПроизводствоОснастки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_СтатусыЗаказаНаПроизводствоОснастки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключенВПлан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Программирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКГравировке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Гравируется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ТипыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ТипыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОпределено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СамоклеящаясяЭтикетка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВплавляемаяЭтикетка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Термоусадка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Упаковка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полуфабрикат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пакеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолуфабрикатПодАппликатор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ЗаказОснастки/Ext/ManagerModule.bsl
// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

Процедура ТекстЗапросаОснасткаНаЗаказ(ТекстЗапроса) Экспорт //+Лико m.shenderov 15.09.2021
	ТекстЗапроса=
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаЦвета.НомерСтроки) КАК КоличествоЦветов,
	|	ЗаказКлиентаЦвета.Ссылка КАК Заказ
	|ПОМЕСТИТЬ ТабЦветов
	|ИЗ
	|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
	|ГДЕ
	|	ЗаказКлиентаЦвета.Ссылка = &Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаЦвета.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаВидыРабот.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ГорячееТиснениеПлоское)
	|			ТОГДА ВЫБОР
	|					КОГДА ЗаказКлиентаВидыРабот.НаправлениеПротяжки = ЗНАЧЕНИЕ(Перечисление.Лико_НаправленияПротяжки.Поперечное)
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПоперечное)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПродольное)
	|				КОНЕЦ
	|		ИНАЧЕ ЗаказКлиентаВидыРабот.ВидСекции.ВидРабот
	|	КОНЕЦ КАК ВидРабот,
	|	ЗаказКлиентаВидыРабот.РабочийЦентр КАК РабочийЦентр,
	|	ЗаказКлиентаВидыРабот.Оснастка КАК Номенклатура,
	|	ЗаказКлиентаВидыРабот.ЗаказНовойОснастки КАК ЗаказНовойОснастки,
	|	ЗаказКлиентаВидыРабот.Ссылка.ОсновнойМатериал КАК Материал,
	|	ЗаказКлиентаВидыРабот.Ссылка.Партнер КАК Партнер,
	|	ЗаказКлиентаВидыРабот.Ссылка.ОсновнойМатериал КАК ОсновнойМатериал,
	|	ЗаказКлиентаВидыРабот.Ссылка.МетражПМ КАК МетражПМ,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
	|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.Нарезка
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЗаказКлиентаВидыРабот.Нарезка <> ЗНАЧЕНИЕ(Справочник.Яссм_Нарезки.ПустаяСсылка)
	|					ТОГДА ЗаказКлиентаВидыРабот.Нарезка
	|				ИНАЧЕ Лико_ПараметрыШтампа.Нарезка
	|			КОНЕЦ
	|	КОНЕЦ КАК Нарезка,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
	|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.ЭтикетокНаЛисте
	|		ИНАЧЕ Лико_ПараметрыШтампа.ЭтикетокНаЛисте
	|	КОНЕЦ КАК ЭтикетокНаЛисте,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
	|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.ШагПечати
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЗаказКлиентаВидыРабот.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Нумератор)
	|						И ЗаказКлиентаВидыРабот.КоличествоРучьевНумератора <> 0
	|					ТОГДА ЗаказКлиентаВидыРабот.КоличествоРучьевНумератора
	|				КОГДА ЗаказКлиентаВидыРабот.Подача <> 0
	|					ТОГДА ЗаказКлиентаВидыРабот.Подача
	|				ИНАЧЕ Лико_ПараметрыШтампа.ШагПечати
	|			КОНЕЦ
	|	КОНЕЦ КАК ШагПечати,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
	|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.Ручьи
	|		ИНАЧЕ Лико_ПараметрыШтампа.Ручьи
	|	КОНЕЦ КАК Ручьи,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
	|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.ДлинаЭтикетки
	|		ИНАЧЕ Лико_ПараметрыШтампа.ДлинаЭтикетки
	|	КОНЕЦ КАК ДлинаЭтикетки,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
	|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.ШиринаЭтикетки
	|		ИНАЧЕ Лико_ПараметрыШтампа.ШиринаЭтикетки
	|	КОНЕЦ КАК ШиринаЭтикетки,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
	|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.Z
	|		ИНАЧЕ Лико_ПараметрыШтампа.Z
	|	КОНЕЦ КАК Z,
	|	Лико_ПараметрыШтампа.ИнтервалМеждуРучьями КАК ИнтервалМеждуРучьями,
	|	Лико_ПараметрыШтампа.ИнтервалМеждуЭтикетками КАК ИнтервалМеждуЭтикетками,
	|	ЗаказКлиентаВидыРабот.Ссылка.Менеджер КАК Менеджер,
	|	ТабЦветов.КоличествоЦветов КАК КоличествоЦветов,
	|	ЗаказКлиентаВидыРабот.Ссылка КАК Заказ,
	|	ЗаказКлиентаВидыРабот.РабочийЦентр.ВидРабочегоЦентра КАК ВидРЦ,
	|	ЗаказКлиентаВидыРабот.Ссылка.Тираж КАК Тираж,
	|	ЗаказКлиентаВидыРабот.Ссылка.Регион КАК Регион,
	|	Лико_ПараметрыШтампа.ТипШтампа КАК ТипШтампа
	|ПОМЕСТИТЬ ВтОснастка
	|ИЗ
	|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаВидыРабот
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
	|		ПО ЗаказКлиентаВидыРабот.Оснастка = Лико_ПараметрыШтампа.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабЦветов КАК ТабЦветов
	|		ПО ЗаказКлиентаВидыРабот.Ссылка = ТабЦветов.Заказ
	|ГДЕ
	|	ЗаказКлиентаВидыРабот.Ссылка = &Заказ
	|	И (ЗаказКлиентаВидыРабот.Оснастка <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ИЛИ ЗаказКлиентаВидыРабот.ЗаказНовойОснастки = ИСТИНА)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаВидыРабот.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ГорячееТиснениеПлоское)
	|			ТОГДА ВЫБОР
	|					КОГДА ЗаказКлиентаВидыРабот.НаправлениеПротяжки = ЗНАЧЕНИЕ(Перечисление.Лико_НаправленияПротяжки.Поперечное)
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПоперечное)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПродольное)
	|				КОНЕЦ
	|		ИНАЧЕ ЗаказКлиентаВидыРабот.ВидСекции.ВидРабот
	|	КОНЕЦ,
	|	ЗаказКлиентаВидыРабот.РабочийЦентр,
	|	Ном.Ссылка,
	|	ЗаказКлиентаВидыРабот.ЗаказНовойОснастки,
	|	ЗаказКлиентаВидыРабот.Ссылка.ОсновнойМатериал,
	|	ЗаказКлиентаВидыРабот.Ссылка.Партнер,
	|	ЗаказКлиентаВидыРабот.Ссылка.ОсновнойМатериал,
	|	ЗаказКлиентаВидыРабот.Ссылка.МетражПМ,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
	|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.Нарезка
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЗаказКлиентаВидыРабот.Нарезка <> ЗНАЧЕНИЕ(Справочник.Яссм_Нарезки.ПустаяСсылка)
	|					ТОГДА ЗаказКлиентаВидыРабот.Нарезка
	|				ИНАЧЕ Лико_ПараметрыШтампа.Нарезка
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
	|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.ЭтикетокНаЛисте
	|		ИНАЧЕ Лико_ПараметрыШтампа.ЭтикетокНаЛисте
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
	|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.ШагПечати
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЗаказКлиентаВидыРабот.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Нумератор)
	|						И ЗаказКлиентаВидыРабот.КоличествоРучьевНумератора <> 0
	|					ТОГДА ЗаказКлиентаВидыРабот.КоличествоРучьевНумератора
	|				КОГДА ЗаказКлиентаВидыРабот.Подача <> 0
	|					ТОГДА ЗаказКлиентаВидыРабот.Подача
	|				ИНАЧЕ Лико_ПараметрыШтампа.ШагПечати
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
	|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.Ручьи
	|		ИНАЧЕ Лико_ПараметрыШтампа.Ручьи
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
	|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.ДлинаЭтикетки
	|		ИНАЧЕ Лико_ПараметрыШтампа.ДлинаЭтикетки
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
	|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.ШиринаЭтикетки
	|		ИНАЧЕ Лико_ПараметрыШтампа.ШиринаЭтикетки
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
	|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.Z
	|		ИНАЧЕ Лико_ПараметрыШтампа.Z
	|	КОНЕЦ,
	|	Лико_ПараметрыШтампа.ИнтервалМеждуРучьями,
	|	Лико_ПараметрыШтампа.ИнтервалМеждуЭтикетками,
	|	ЗаказКлиентаВидыРабот.Ссылка.Менеджер,
	|	ТабЦветов.КоличествоЦветов,
	|	ЗаказКлиентаВидыРабот.Ссылка,
	|	ЗаказКлиентаВидыРабот.РабочийЦентр.ВидРабочегоЦентра,
	|	ЗаказКлиентаВидыРабот.Ссылка.Тираж,
	|	ЗаказКлиентаВидыРабот.Ссылка.Регион,
	|	Лико_ПараметрыШтампа.ТипШтампа
	|ИЗ
	|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаВидыРабот
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабЦветов КАК ТабЦветов
	|		ПО ЗаказКлиентаВидыРабот.Ссылка = ТабЦветов.Заказ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
	|			ПО Ном.Ссылка = Лико_ПараметрыШтампа.Номенклатура
	|		ПО ЗаказКлиентаВидыРабот.Оснастка.Артикул = Ном.Артикул
	|			И ЗаказКлиентаВидыРабот.Оснастка.Артикул = Ном.Артикул
	|			И (Ном.Наименование ПОДОБНО ""%контрматрица%""
	|				ИЛИ Ном.Наименование ПОДОБНО ""%кондуктор%"")
	|ГДЕ
	|	ЗаказКлиентаВидыРабот.Ссылка = &Заказ
	|	И (ЗаказКлиентаВидыРабот.Оснастка <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ИЛИ ЗаказКлиентаВидыРабот.ЗаказНовойОснастки = ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Лико_БланкЭтапаВыпуск.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВтВнутреннееПроизводство
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Выпуск КАК Лико_БланкЭтапаВыпуск
	|ГДЕ
	|	Лико_БланкЭтапаВыпуск.Ссылка.Проведен
	|	И НЕ Лико_БланкЭтапаВыпуск.Ссылка.ПометкаУдаления
	|	И Лико_БланкЭтапаВыпуск.Ссылка.РабочийЦентр.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.ГравировальныйУчасток)
	|	И Лико_БланкЭтапаВыпуск.Номенклатура В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ВТ.Номенклатура
	|			ИЗ
	|				ВтОснастка КАК ВТ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВтОснастка.ВидРабот КАК ВидРабот,
	|	ВтОснастка.РабочийЦентр КАК РабочийЦентр,
	|	ВтОснастка.Номенклатура КАК Номенклатура,
	|	ВтОснастка.ЗаказНовойОснастки КАК ЗаказНовойОснастки,
	|	ВтОснастка.Материал КАК Материал,
	|	ВтОснастка.Партнер КАК Партнер,
	|	ВтОснастка.ОсновнойМатериал КАК ОсновнойМатериал,
	|	ВтОснастка.МетражПМ КАК МетражПМ,
	|	ВтОснастка.Нарезка КАК Нарезка,
	|	ВтОснастка.ЭтикетокНаЛисте КАК ЭтикетокНаЛисте,
	|	ВтОснастка.ШагПечати КАК ШагПечати,
	|	ВтОснастка.Ручьи КАК Ручьи,
	|	ВтОснастка.ДлинаЭтикетки КАК ДлинаЭтикетки,
	|	ВтОснастка.ШиринаЭтикетки КАК ШиринаЭтикетки,
	|	ВтОснастка.Z КАК Z,
	|	ВтОснастка.ИнтервалМеждуРучьями КАК ИнтервалМеждуРучьями,
	|	ВтОснастка.ИнтервалМеждуЭтикетками КАК ИнтервалМеждуЭтикетками,
	|	ВтОснастка.Менеджер КАК Менеджер,
	|	ВтОснастка.КоличествоЦветов КАК КоличествоЦветов,
	|	ВтОснастка.Заказ КАК Заказ,
	|	ВтОснастка.ВидРЦ КАК ВидРЦ,
	|	ВтОснастка.Тираж КАК Тираж,
	|	ВтОснастка.Регион КАК Регион,
	|	ВтОснастка.ТипШтампа КАК ТипШтампа,
	|	ВЫБОР
	|		КОГДА ВтВнутреннееПроизводство.Номенклатура ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВнутреннийЗаказ
	|ИЗ
	|	ВтОснастка КАК ВтОснастка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтВнутреннееПроизводство КАК ВтВнутреннееПроизводство
	|		ПО ВтОснастка.Номенклатура = ВтВнутреннееПроизводство.Номенклатура";
	
	
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 15.09.2021


Функция  СоздатьЗаказНаполуфабрикат(Организация,Площадка,ЗаказКлиента,Партнер,Регион,Номенклатура,Количество,НаправитьВРаботу=Ложь,СозданВПроизводстве=Ложь) Экспорт 
	УстановитьПривилегированныйРежим(Истина);
	Если СтрНайти(НРег(Номенклатура.Наименование),"контрматрица") Тогда		
		
		Этап   = Справочники.Лико_ЭтапыВыполненияЗаказа.ГотовКГравировке;
		Статус = Перечисления.Лико_СтатусыЗаказаНаПроизводствоОснастки.ГотовКГравировке;
		
	Иначе 		
		
		Этап   = Справочники.Лико_ЭтапыВыполненияЗаказа.ВключенВПлан;
		Статус = Перечисления.Лико_СтатусыЗаказаНаПроизводствоОснастки.ВключенВПлан;
		
	КонецЕсли;
	
	
	Ссылка=Неопределено;
	НачатьТранзакцию();
	
	НовыйЗаказ              							=  Документы.ЗаказКлиента.СоздатьДокумент();
	НовыйЗаказ.ИнициализироватьНачальныеПараметры(Неопределено);
	
	НовыйЗаказ.ТипЗаказа    								= Перечисления.Лико_ТипыЗаказов.Полуфабрикат;
	НовыйЗаказ.Партнер      								= ?(ЗначениеЗаполнено(ЗаказКлиента),ЗаказКлиента.Партнер,Партнер);
	НовыйЗаказ.Контрагент   								= ЗаказКлиента.Контрагент;
	//НовыйЗаказ.СтатусЗаказаНаПроизводствоОснасткиОснастки	= Перечисления.Лико_СтатусыЗаказаНаПроизводствоОснастки.ВключенВПлан;
	НовыйЗаказ.СтатусЗаказаНаПроизводствоОснасткиОснастки	= Статус;
	// <-- Начало Лико Яцун С. В. 21.10.2025 
	НовыйЗаказ.Менеджер   									= ЗаказКлиента.Менеджер;
	// <-- Конец Лико Яцун С. В. 21.10.2025
	
	НовыйЗаказ.Организация  							 	= Организация;
	НовыйЗаказ.ВидЗаказа    							 	= Перечисления.Лико_ВидыЗаказов.Оснастка;
	НовыйЗаказ.Склад										= ПараметрыСеанса.Лико_РабочееМесто.СкладСИМ;
	НовыйЗаказ.Регион       								= Регион;
	НовыйЗаказ.Площадка     								= Площадка;
	НовыйЗаказ.Валюта       								= ЗаказКлиента.Валюта;
	НовыйЗаказ.Этикетки     								= ЗаказКлиента.Этикетки;
	РЦ														= ПолучитьРабочийЦентрГравировальныйУчасток(Площадка);
	НовыйЗаказ.ВалютаДляДокументов 							= ЗаказКлиента.ВалютаДляДокументов;
	НовыйЗаказ.Дата         								= ТекущаяДата(); 	
	ТЧТовары                								= НовыйЗаказ.Товары;
	НоваяСтрокаПФ           								= ТЧТовары.Добавить();
	НоваяСтрокаПФ.Номенклатура 								= Номенклатура;
	НоваяСтрокаПФ.КоличествоУпаковок 						= Количество;
	НоваяСтрокаПФ.Количество        						= Количество;
	НоваяСтрокаПФ.Заказ 									= ЗаказКлиента;
	НовыйВидРабот											= НовыйЗаказ.ВидыРабот.Добавить();
	НовыйВидРабот.РабочийЦентр								= РЦ;
	НовыйВидРабот.ВидРабот									= Справочники.ВидыРаботСотрудников.Гравировка;
	НовыйВидРабот.НомерПроката								= 1;
	НовыйЗаказ.Подразделение								= НовыйВидРабот.РабочийЦентр.ВидРабочегоЦентра.Подразделение;
	НовыйЗаказ.СозданВПроизводстве							= СозданВПроизводстве;
	НовыйЗаказ.Записать();
	
	Лико_ОбщегоНазначенияСервер.ЗаписатьРСЛико_ЭтапыЗаказа(
	НовыйЗаказ.Ссылка,
	Площадка,
	Этап,
	НовыйЗаказ.Дата,
	Новый Структура("Ответственный,Количество",Пользователи.ТекущийПользователь(),1)	
	);
	Ссылка=НовыйЗаказ.Ссылка;	
	//Если НаправитьВРаботу Тогда
	НаправитьВРаботу(Ссылка,Номенклатура);
	//КонецЕсли;
	
	ЗафиксироватьТранзакцию();											
	
	Возврат Ссылка;	
	
КонецФункции

Процедура НаправитьВРаботу(Заказ,Номенклатура) //+Лико m.shenderov 02.09.2021
	
	//Лико_Планирование.НаправитьВРаботуЗаказОснастки(Заказ);
	
	#Если ВнешнееСоединение ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
		
	#Иначе
		Лико_Планирование.НаправитьВРаботуЗаказОснастки(Заказ);
		
	#КонецЕсли	
	
	
	Этап=Лико_Дополнительно.НайтиВыпускающийЭтапПоЗаказуКлиента(Заказ,,Ложь);
	РабочийЦентр=НайтиРЦПерессГравировки();
	Если  УправлениеСвойствами.ЗначениеСвойства(Номенклатура,"ОстасткаВидШтампа")=Справочники.Лико_ВидШтампа.КонгревКонтрМатрица Тогда
		
		Лико_Дополнительно.ДобавитьЭтапПроизводстваВКонецПлана(Этап,РабочийЦентр,Заказ,1);
	КонецЕсли;
	ОснасткаСоздатьСообщение(Заказ);
КонецПроцедуры  //-Лико m.shenderov 02.09.2021

Функция ПолучитьРабочийЦентрГравировальныйУчасток(Площадка) //+Лико m.shenderov 24.08.2021
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РабочиеЦентры.Ссылка КАК Ссылка,
	|	РабочиеЦентры.ПорядковыйНомер КАК ПорядковыйНомер
	|ИЗ
	|	Справочник.РабочиеЦентры КАК РабочиеЦентры
	|ГДЕ
	|	РабочиеЦентры.Лико_Площадка = &Площадка
	|	И РабочиеЦентры.ПорядковыйНомер <> 0
	|	И РабочиеЦентры.ВидРабочегоЦентра = &ВидРабочегоЦентра
	|
	|УПОРЯДОЧИТЬ ПО
	|	РабочиеЦентры.ПорядковыйНомер";
	Запрос.УстановитьПараметр("Площадка",Площадка );
	Запрос.УстановитьПараметр("ВидРабочегоЦентра",Справочники.ВидыРабочихЦентров.ГравировальныйУчасток);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла; 
	
КонецФункции  //-Лико m.shenderov 24.08.2021



Функция НайтиРЦПерессГравировки() //+Лико m.shenderov 13.09.2021
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ Ссылка КАК РЦ ИЗ Справочник.РабочиеЦентры КАК РЦ ГДЕ РЦ.Лико_ПрессГравировки";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.РЦ;
	КонецЦикла; 
	
	
КонецФункции //-Лико m.shenderov 13.09.2021 



Процедура ОснасткаСоздатьСообщение(Заказ) Экспорт //+Лико m.shenderov 02.09.2021
	УстановитьПривилегированныйРежим(Истина);	
	Если Заказ.СтатусЗаказаНаПроизводствоОснасткиОснастки=Перечисления.Лико_СтатусыЗаказаНаПроизводствоОснастки.ВключенВПлан  Тогда		
		ЗаголовокСообщения="Включен в план";
		ТипСообщения=Справочники.Лико_ТипыСообщений.ПрограммированиеОснастки;		
	Иначе
		ЗаголовокСообщения="Готов к гравировке";
		ТипСообщения=Справочники.Лико_ТипыСообщений.ГотовКГравировкеОснастки;		
	КонецЕсли;
	
	Текст =  СтрШаблон("Заказ на производство оснастки: %1 %2!",Заказ.НомерБезПрефикса,НРег(ЗаголовокСообщения));
	
	Тема  = Текст;
	Текст=Текст+ Символы.ПС+ "Ссылка : "+Символы.ПС+Символы.ВК+ПолучитьНавигационнуюСсылку(Заказ.Ссылка);
	Для каждого Товар  Из Заказ.Товары  Цикл
		Текст=Текст+Символы.ПС+Символы.ВК;
		Текст=Текст+ "        Номенклатура :  "+ СокрЛП(Товар.Номенклатура.Артикул)+" "+Строка(Товар.Номенклатура.Наименование);			
	КонецЦикла;	
	Текст=Текст+Символы.ПС+Символы.ВК;
	Текст=Текст+Заказ.Комментарий+Символы.ПС+Символы.ВК;
	
	Структура = Новый Структура;
	Структура.Вставить("НомерЗаказа",Заказ.НомерБезПрефикса);
	Структура.Вставить("Статус",ЗаголовокСообщения);
	Структура.Вставить("Сотрудник",ПараметрыСеанса.ТекущийПользователь);
	Для каждого  Товар Из  Заказ.Товары Цикл
		Структура.Вставить("Код",Товар.Номенклатура.Код);
		Структура.Вставить("Артикул",Товар.Номенклатура.Артикул);
		Структура.Вставить("Наименование",Товар.Номенклатура.Наименование);
		Структура.Вставить("Количество",Товар.Количество);
		
	КонецЦикла;
	Комментарий=Заказ.Комментарий+Символы.ПС+Символы.ВК;
	Если ЗначениеЗаполнено(Заказ.Комментарий) ТОгда
		Структура.Вставить("Комментарий",Комментарий);
	КонецЕсли;
	Структура.Вставить("Ссылка",ПолучитьНавигационнуюСсылку(Заказ.Ссылка));
	
	
	
	Макет=ПолучитьМакет("МакетСообщения");
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры,Структура);
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	//Преобразование ТабДок к HTML
	ИмяФайла = ПолучитьИмяВременногоФайла("html");
	ТабличныйДокумент.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.HTML5);
	HTMLФайл = Новый ТекстовыйДокумент;
	HTMLФайл.Прочитать(ИмяФайла);
	ТекстHTMLФайла = HTMLФайл.ПолучитьТекст();
	УдалитьФайлы(ИмяФайла);
	
	
	Адресат = Справочники.Лико_ТипыСообщений.ПолучитьПочтовыеАдреса(ТипСообщения,Заказ.Площадка); 		
	
	//Лико_Планирование.ОтправитьПисьмо(Текст, Тема, Адресат,,"textBody"); 
	
	
	#Если ВнешнееСоединение ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
		
	#Иначе
		Лико_Планирование.ОтправитьПисьмо(ТекстHTMLФайла, Тема, Адресат);
	#КонецЕсли	
	
	
	
КонецПроцедуры //-Лико m.shenderov 02.09.2021
